Revit 2027 API
FabricationConfiguration.GetPartCustomDataName Method
 Gets the custom data name from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetPartCustomDataName(
	int customDataId
)
Public Function GetPartCustomDataName (
	customDataId As Integer
) As String
public:
String^ GetPartCustomDataName(
	int customDataId
)
member GetPartCustomDataName :
        customDataId : int -> string
Parameters
customDataId Int32
 The custom data identifier.
Return Value
String
 The custom data name.
Exceptions
Exception | Condition
ArgumentException |  The custom data does not exist.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace